In [8]:
import pandas
df = pandas.read_csv("http://pythonhow.com/supermarkets.csv")
df = df[:3]
df = df.set_index("ID")
print(df)

            Address            City             State Country          Name  \
ID
1      3666 21st St   San Francisco          CA 94114     USA       Madeira
2    735 Dolores St   San Francisco          CA 94119     USA   Bready Shop
3       332 Hill St   San Francisco  California 94114     USA   Super River

    Employees
ID
1           8
2          15
3          25

## Drop columns

axis=1 denotes that we are referring to a column, not a row

**With column name**

In [9]:
df.drop("City", axis=1)

            Address             State Country          Name  Employees
ID
1      3666 21st St          CA 94114     USA       Madeira          8
2    735 Dolores St          CA 94119     USA   Bready Shop         15
3       332 Hill St  California 94114     USA   Super River         25

In [10]:
df.drop(df.columns[0:3],1)

   Country          Name  Employees
ID
1      USA       Madeira          8
2      USA   Bready Shop         15
3      USA   Super River         25

**With row ID**

In [11]:
df.drop(df.index[1:],0)

          Address           City      State Country      Name  Employees
ID
1    3666 21st St  San Francisco   CA 94114     USA   Madeira          8

## Update and add columns

In [12]:
df["Continent"] = df.shape[0]*["Testing"]
df["Continent"] = df["Continent"] +" value"
df

,Address,City,State,Country,Name,Employees,Continent
ID,,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,Testing value
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,Testing value
3,332 Hill St,San Francisco,California 94114,USA,Super River,25,Testing value

## Append new rows (Tricks)

In [13]:
df_t = df.T
df_t[len(df) + 1] = ["a","b","c","d","e","f","Testing value"]
print(df_t)
df = df_t.T
df

ID                     1                2                 3              4
Address     3666 21st St   735 Dolores St       332 Hill St              a
City       San Francisco    San Francisco     San Francisco              b
State           CA 94114         CA 94119  California 94114              c
Country              USA              USA               USA              d
Name             Madeira      Bready Shop       Super River              e
Employees              8               15                25              f
Continent  Testing value    Testing value     Testing value  Testing value

,Address,City,State,Country,Name,Employees,Continent
ID,,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,Testing value
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,Testing value
3,332 Hill St,San Francisco,California 94114,USA,Super River,25,Testing value
4,a,b,c,d,e,f,Testing value